Name : Gourav Verma<br>
Class : DSC540-T303<br>
Topic : Storing Data<br>
Assignment : Weeks 11 & 12 Excercises<br>

In [27]:
# Import important libraries

import pandas as pd
import warnings
warnings.filterwarnings('ignore')

### Activity 12: Data Wrangling Task - Fixing UN Data

In [28]:
# Read UN data
education_data_link="http://data.un.org/_Docs/SYB/CSV/SYB61_T07_Education.csv"
UN_df = pd.read_csv(education_data_link, skiprows=1)
UN_df.head()

,Region/Country/Area,Unnamed: 1,Year,Series,Value,Footnotes,Source
0,1,"Total, all countries or areas",2005,Students enrolled in primary education (thousa...,"678,990",NaN,"United Nations Educational, Scientific and Cul..."
1,1,"Total, all countries or areas",2005,Gross enrollement ratio - Primary (male),104.8,NaN,"United Nations Educational, Scientific and Cul..."
2,1,"Total, all countries or areas",2005,Gross enrollment ratio - Primary (female),99.8,NaN,"United Nations Educational, Scientific and Cul..."
3,1,"Total, all countries or areas",2005,Students enrolled in secondary education (thou...,"509,100",NaN,"United Nations Educational, Scientific and Cul..."
4,1,"Total, all countries or areas",2005,Gross enrollment ratio - Secondary (male),65.7,NaN,"United Nations Educational, Scientific and Cul..."

In [29]:
# Drop the column Region/Country/Area and Source. 

UN_df1 = UN_df.drop(['Region/Country/Area','Source'],axis=1)

In [30]:
# Rename columns

UN_df1.columns=['Region/Country/Area','Year','Data','Value','Footnotes']
UN_df1.head()

,Region/Country/Area,Year,Data,Value,Footnotes
0,"Total, all countries or areas",2005,Students enrolled in primary education (thousa...,"678,990",NaN
1,"Total, all countries or areas",2005,Gross enrollement ratio - Primary (male),104.8,NaN
2,"Total, all countries or areas",2005,Gross enrollment ratio - Primary (female),99.8,NaN
3,"Total, all countries or areas",2005,Students enrolled in secondary education (thou...,"509,100",NaN
4,"Total, all countries or areas",2005,Gross enrollment ratio - Secondary (male),65.7,NaN

In [31]:
# Check unique values in Footnote column

UN_df1['Footnotes'].unique()

array([nan, 'Estimate.',
       'For statistical purposes, the data for China do not include those for the Hong Kong Special Administrative Region (Hong Kong SAR), Macao Special Administrative Region (Macao SAR) and Taiwan Province of China.'],
      dtype=object)

In [32]:
# Check type of value column

type(UN_df1['Value'])

pandas.core.series.Series

In [33]:
# Function to convert string into flot

def to_numeric(val):
    """
    Converts a given string (with one or more commas) to a numeric value
    """
    if ',' not in str(val):            # Check if string contains a ","
        result = float(val)            # Convert to float
    else:
        val=str(val)
        val=''.join(str(val).split(','))  # Remove "," from string
        result=float(val)
    return result

In [34]:
# Use apply method to apply the function on Value column

UN_df1['Value'].apply(to_numeric)

0       678990.0
1          104.8
2           99.8
3       509100.0
4           65.7
          ...
8157         6.5
8158         5.5
8159       136.0
8160         8.9
8161         8.0
Name: Value, Length: 8162, dtype: float64

In [35]:
# Print unique values of Data column

UN_df1['Data'].unique()

array(['Students enrolled in primary education (thousands)',
       'Gross enrollement ratio - Primary (male)',
       'Gross enrollment ratio - Primary (female)',
       'Students enrolled in secondary education (thousands)',
       'Gross enrollment ratio - Secondary (male)',
       'Gross enrollment ratio - Secondary (female)',
       'Students enrolled in tertiary education (thousands)',
       'Gross enrollment ratio - Tertiary (male)',
       'Gross enrollment ratio - Tertiary (female)'], dtype=object)